Types_All_The_Way_Down.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Types All The Way Down</title>
<meta name="author" content="(@krisajenkins)"/>
<link rel="stylesheet" href="reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="reveal.js/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Types All The Way Down</h1><h2 class="author">@krisajenkins</h2>
</section>

<section>
<section id="slide-orgheadline5">
<h2 id="orgheadline5">A Tale of a Haskell Startup</h2>
<ul>
<li>ClojureScript + Haskell + PostgreSQL</li>
<li>Technically adept</li>

</ul>
</section>
<section id="slide-orgheadline1">
<h3 id="orgheadline1">We Didn't Have The Problems I'd Expect</h3>
<ul>
<li class="fragment appear">Inconsistent data formats.</li>
<li class="fragment appear">Need for data to change.</li>
<li class="fragment appear">Speed of change.</li>
<li class="fragment appear">Reliability.</li>

</ul>

</section>
<section id="slide-orgheadline2">
<h3 id="orgheadline2">The Problems We Actually Had</h3>
<ul>
<li class="fragment appear">Database queries failing at runtime.</li>
<li class="fragment appear">Frontend and backend disagreeing.</li>

</ul>
</section>
<section id="slide-orgheadline3">
<h3 id="orgheadline3">These Are The Same Problem</h3>
<ol>
<li>The backend has changed, the database hasn't.</li>
<li>The backend has changed, the frontend hasn't.</li>

</ol>
<p class="fragment (appear)">
This is a is schema synchronization problem.
</p>
</section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">Solve:</h3>
<ul>
<li class="fragment appear">Keep all three tiers' schemas consistent.</li>
<li class="fragment appear">The same types, all the way down.</li>
<li class="fragment appear">Reliably &amp; cheaply.</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgheadline6">
<h2 id="orgheadline6">First Solution</h2>
<p>
One language to rule them all.
</p>

<p class="fragment (appear)">
Signs point to Nope.
</p>

</section>
</section>
<section>
<section id="slide-orgheadline7">
<h2 id="orgheadline7">Second Solution</h2>
<p>
Some setup required.
</p>
</section>
</section>
<section>
<section id="slide-orgheadline15">
<h2 id="orgheadline15">The Backend</h2>
<p>
&#x2026;is <i>mostly</i> solved.
</p>

<p class="fragment (appear)">
Persistent.
</p>
</section>
<section id="slide-orgheadline8">
<h3 id="orgheadline8">Generating DB Migrations</h3>
</section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9">Define a Table</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #F92672; font-style: italic;">share</span> <span style="color: #66d9ef;">[</span>mkPersist sqlSettings, mkMigrate <span style="color: #E6DB74;">"migrateEpc"</span><span style="color: #66d9ef;">]</span>
      <span style="color: #66d9ef;">[</span>persistLowerCase<span style="color: #E6DB74;">|</span>
<span style="color: #E6DB74;">  EnergyDisplayCertificate</span>
<span style="color: #E6DB74;">    buildingNumber Text Maybe sqltype=text</span>
<span style="color: #E6DB74;">    postcode Text sqltype=text</span>
<span style="color: #E6DB74;">    energyRatingDescription Text sqltype=text</span>
<span style="color: #E6DB74;">    renewablesThermal Text sqltype=text</span>
<span style="color: #E6DB74;">    renewablesElectrical Text sqltype=text</span>
<span style="color: #E6DB74;">    floorArea Double Maybe</span>
<span style="color: #E6DB74;">    lodgementDate UTCTime</span>

<span style="color: #E6DB74;">    deriving Eq Show Generic</span>
<span style="color: #E6DB74;">|</span><span style="color: #66d9ef;">]</span>
</pre>
</div>
</section>
<section id="slide-orgheadline10">
<h3 id="orgheadline10">Get an Automatic Migration-Calculator</h3>
<div class="org-src-container">

<pre  class="src src-ghci">ghci&gt; :t migrateEpc
migrateEpc :: Database.Persist.Sql.Types.Migration
</pre>
</div>

</section>
<section id="slide-orgheadline11">
<h3 id="orgheadline11">Run It</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #F92672; font-style: italic;">migrations</span> <span style="color: #F92672;">::</span> <span style="color: #66D9EF;">SqlPersistM</span> <span style="color: #66d9ef;">()</span>
<span style="color: #F92672; font-style: italic;">migrations</span> <span style="color: #F92672;">=</span> mapM_ runMigration <span style="color: #66d9ef;">[</span>migrateEpc, <span style="color: #F92672;">...</span><span style="color: #66d9ef;">]</span>

<span style="color: #66D9EF;">do</span> pool <span style="color: #F92672;">&lt;-</span> <span style="color: #F92672;">...</span>
   runSqlPersistMPool migrations sql
</pre>
</div>
</section>
<section id="slide-orgheadline12">
<h3 id="orgheadline12">Check The Table</h3>
<div class="org-src-container">

<pre  class="src src-shell"><span style="color: #F92672;">db</span>=# \d energy_display_certificate
       Table <span style="color: #E6DB74;">"public.energy_display_certificate"</span>
          Column           |           Type           | ...
---------------------------+--------------------------+----
 id                        | bigint                   | ...
 building_number           | text                     | ...
 postcode                  | text                     | ...
 energy_rating_description | text                     | ...
 renewables_thermal        | text                     | ...
 renewables_electrical     | text                     | ...
 floor_area                | double precision         | ...
 lodgement_date            | timestamp with time zone | ...
Indexes:
    <span style="color: #E6DB74;">"energy_display_certificate_pkey"</span> PRIMARY KEY, btree <span style="color: #66d9ef;">(</span>id<span style="color: #66d9ef;">)</span>
</pre>
</div>

</section>
<section id="slide-orgheadline13">
<h3 id="orgheadline13">Migrations are Calculated</h3>
<p>
And optionally applied whenever safe:
</p>

<div class="org-src-container">

<pre  class="src src-shell">$ project-startup
Reading config: project.yaml
Migrating: ALTER TABLE <span style="color: #E6DB74;">"energy_display_certificate"</span>
    ALTER COLUMN <span style="color: #E6DB74;">"postcode"</span> TYPE text
Migrating: ALTER TABLE <span style="color: #E6DB74;">"energy_display_certificate"</span>
    ADD COLUMN <span style="color: #E6DB74;">"floor_area"</span> DOUBLE PRECISION NULL
</pre>
</div>
</section>
<section id="slide-orgheadline14">
<h3 id="orgheadline14">Score: 2/3</h3>
<p>
The backend and database are in sync.
</p>

<ul>
<li class="fragment appear">Surprisingly seamless.</li>
<li class="fragment appear">Occasional manual intervention.
<ul>
<li>Never missed.</li>
<li>Guided hints.</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgheadline29">
<h2 id="orgheadline29">The Frontend</h2>
<p>
&#x2026;needs more attention.
</p>

</section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">Generate Frontend Code</h3>
</section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">For Which Frontend Languages</h3>
<p>
&#x2026;would this make sense?
</p>
</section>
<section id="slide-orgheadline24">
<h3 id="orgheadline24">GHC Generics</h3>
<ul>
<li>Haskell datatypes have a simple structure.</li>
<li>Encode that structure as data.</li>
<li>We know how to transform data.</li>
<li>So we can build a new description of the same datastructure.</li>

</ul>

</section>
<section id="slide-orgheadline18">
<h4 id="orgheadline18">Example</h4>
<p>
Let's look at a generic encoding.
</p>

<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #F92672;">$</span> stack ghci
<span style="color: #66D9EF;">Prelude</span><span style="color: #F92672; font-style: italic;">&gt;</span> <span style="color: #66D9EF;">:</span>set <span style="color: #F92672;">-</span><span style="color: #66D9EF;">XRankNTypes</span>
<span style="color: #66D9EF;">Prelude</span><span style="color: #F92672; font-style: italic;">&gt;</span> <span style="color: #66D9EF;">import</span> <span style="color: #66D9EF;">GHC.Generics</span>
</pre>
</div>

</section>
<section id="slide-orgheadline19">
<h4 id="orgheadline19">Example</h4>
<p>
Let's look at the generic encoding for <code>Maybe a</code>
</p>

<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #66D9EF;">:</span>kind<span style="color: #F92672;">!</span> forall a<span style="color: #F92672;">.</span> <span style="color: #66D9EF;">Rep</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">Maybe</span> a<span style="color: #66d9ef;">)</span>
<span style="color: #F92672; font-style: italic;">forall</span> a<span style="color: #F92672;">.</span> <span style="color: #66D9EF;">Rep</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">Maybe</span> a<span style="color: #66d9ef;">)</span> <span style="color: #F92672;">::</span> <span style="color: #F92672;">*</span> <span style="color: #F92672;">-&gt;</span> <span style="color: #F92672;">*</span>
<span style="color: #F92672;">=</span> <span style="color: #66D9EF;">Datatype</span> <span style="color: #66d9ef;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"Maybe"</span><span style="color: #F92672;">...</span><span style="color: #66d9ef;">}</span> <span style="color: #66d9ef;">(</span>
    <span style="color: #66D9EF;">Constructor</span> <span style="color: #a6e22e;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"Nothing"</span><span style="color: #F92672;">...</span><span style="color: #a6e22e;">}</span> <span style="color: #66D9EF;">Unit</span>
    <span style="color: #66D9EF;">:+:</span>
    <span style="color: #66D9EF;">Constructor</span> <span style="color: #a6e22e;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"Just"</span><span style="color: #F92672;">...</span><span style="color: #a6e22e;">}</span> <span style="color: #a6e22e;">(</span><span style="color: #66D9EF;">Field</span> <span style="color: #66D9EF;">NoSelector</span> <span style="color: #e6db74;">(</span><span style="color: #66D9EF;">Recursive</span> a<span style="color: #e6db74;">)</span><span style="color: #a6e22e;">)</span>
  <span style="color: #66d9ef;">)</span>
</pre>
</div>
</section>
<section id="slide-orgheadline20">
<h4 id="orgheadline20">Arbitrary Types</h4>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">Person</span> <span style="color: #F92672;">=</span> <span style="color: #66D9EF;">Person</span> <span style="color: #66d9ef;">{</span> name <span style="color: #F92672;">::</span> <span style="color: #66D9EF;">String</span>,
                       age <span style="color: #F92672;">::</span> <span style="color: #66D9EF;">Int</span> <span style="color: #66d9ef;">}</span>
              <span style="color: #66D9EF;">deriving</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">Show</span>,<span style="color: #66D9EF;">Eq</span>,<span style="color: #66D9EF;">Generic</span><span style="color: #66d9ef;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre  class="fragment (appear)"><span style="color: #66D9EF;">Prelude</span> <span style="color: #66D9EF;">GHC.Generics</span><span style="color: #F92672;">&gt;</span> <span style="color: #66D9EF;">:</span>kind<span style="color: #F92672;">!</span> <span style="color: #66D9EF;">Rep</span> <span style="color: #66D9EF;">Person</span>
<span style="color: #66D9EF;">Rep</span> <span style="color: #66D9EF;">Person</span> <span style="color: #F92672;">::</span> <span style="color: #F92672;">*</span> <span style="color: #F92672;">-&gt;</span> <span style="color: #F92672;">*</span>
<span style="color: #F92672;">=</span> <span style="color: #66D9EF;">Datatype</span> <span style="color: #66d9ef;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"Person"</span><span style="color: #F92672;">...</span><span style="color: #66d9ef;">}</span> <span style="color: #66d9ef;">(</span>
    <span style="color: #66D9EF;">Constructor</span> <span style="color: #a6e22e;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"Person"</span><span style="color: #F92672;">...</span><span style="color: #a6e22e;">}</span> <span style="color: #a6e22e;">(</span>
        <span style="color: #66D9EF;">Selector</span> <span style="color: #e6db74;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"name"</span><span style="color: #F92672;">...</span> <span style="color: #8f8f8f;">(</span><span style="color: #66D9EF;">Ref</span> <span style="color: #66D9EF;">String</span><span style="color: #8f8f8f;">)</span><span style="color: #e6db74;">}</span>
        <span style="color: #66D9EF;">Selector</span> <span style="color: #e6db74;">{</span><span style="color: #F92672;">...</span><span style="color: #E6DB74;">"age"</span><span style="color: #F92672;">...</span> <span style="color: #8f8f8f;">(</span><span style="color: #66D9EF;">Ref</span> <span style="color: #66D9EF;">Int</span><span style="color: #8f8f8f;">)</span><span style="color: #e6db74;">}</span>
    <span style="color: #a6e22e;">)</span>
<span style="color: #66d9ef;">)</span>
</pre>
</div>
</section>
<section id="slide-orgheadline21">
<h4 id="orgheadline21">Describing Datatypes</h4>
<ul>
<li class="fragment appear">Metadata
<ul>
<li>Datatypes (<code>data Maybe a = ...</code>)</li>
<li>Constructors (<code>Person ...</code>)</li>
<li>Fields (<code>Just a</code>)</li>

</ul></li>
<li class="fragment appear">References
<ul>
<li>Concrete (<code>Person String</code>)</li>
<li>Abstract (<code>Just a</code>)</li>

</ul></li>

</ul>
</section>
<section id="slide-orgheadline22">
<h4 id="orgheadline22">Describing Datatypes (2)</h4>
<ul>
<li class="fragment appear">Combination
<ul>
<li>OR (<code>Nothing | Just a</code>)</li>
<li>AND (<code>Person String Int</code>)</li>

</ul></li>
<li class="fragment appear">Extras
<ul>
<li>Constructors without fields (<code>Nothing</code>)</li>
<li>Datatypes without constructors (<code>data Empty</code>)</li>

</ul></li>

</ul>

</section>
<section id="slide-orgheadline23">
<h4 id="orgheadline23">Really</h4>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #66D9EF;">:</span>kind<span style="color: #F92672;">!</span> forall a<span style="color: #F92672;">.</span> <span style="color: #66D9EF;">Rep</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">Maybe</span> a<span style="color: #66d9ef;">)</span>
<span style="color: #F92672; font-style: italic;">forall</span> a<span style="color: #F92672;">.</span> <span style="color: #66D9EF;">Rep</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">Maybe</span> a<span style="color: #66d9ef;">)</span> <span style="color: #F92672;">::</span> <span style="color: #F92672;">*</span> <span style="color: #F92672;">-&gt;</span> <span style="color: #F92672;">*</span>
<span style="color: #F92672;">=</span> <span style="color: #66D9EF;">D1</span> <span style="color: #66D9EF;">GHC.Generics.D1Maybe</span>
    <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">C1</span> <span style="color: #66D9EF;">GHC.Generics.C1_0Maybe</span> <span style="color: #66D9EF;">U1</span>
     <span style="color: #66D9EF;">:+:</span> <span style="color: #66D9EF;">C1</span> <span style="color: #66D9EF;">GHC.Generics.C1_1Maybe</span> <span style="color: #a6e22e;">(</span><span style="color: #66D9EF;">S1</span> <span style="color: #66D9EF;">NoSelector</span> <span style="color: #e6db74;">(</span><span style="color: #66D9EF;">Rec0</span> a<span style="color: #e6db74;">)</span><span style="color: #a6e22e;">)</span><span style="color: #66d9ef;">)</span>
</pre>
</div>


</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25"><span class="todo TODO">TODO</span> </h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #66D9EF;">instance</span> <span style="color: #66d9ef;">(</span><span style="color: #66D9EF;">GenericElmType</span> f
         ,<span style="color: #66D9EF;">GenericElmType</span> g<span style="color: #66d9ef;">)</span> <span style="color: #F92672;">=&gt;</span>
         <span style="color: #66D9EF;">GenericElmType</span> <span style="color: #66d9ef;">(</span>f <span style="color: #66D9EF;">:*:</span> g<span style="color: #66d9ef;">)</span> <span style="color: #66D9EF;">where</span>
  genericToElmType <span style="color: #66D9EF;">_</span> <span style="color: #F92672;">=</span>
    <span style="color: #66D9EF;">Product</span> <span style="color: #66d9ef;">(</span>genericToElmType <span style="color: #a6e22e;">(</span>undefined <span style="color: #F92672;">::</span> f p<span style="color: #a6e22e;">)</span><span style="color: #66d9ef;">)</span>
            <span style="color: #66d9ef;">(</span>genericToElmType <span style="color: #a6e22e;">(</span>undefined <span style="color: #F92672;">::</span> g p<span style="color: #a6e22e;">)</span><span style="color: #66d9ef;">)</span>
</pre>
</div>

</section>
<section id="slide-orgheadline26">
<h3 id="orgheadline26">Usage</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #F92672; font-style: italic;">main</span> <span style="color: #F92672;">::</span> <span style="color: #66D9EF;">IO</span> <span style="color: #66d9ef;">()</span>
<span style="color: #F92672; font-style: italic;">main</span> <span style="color: #F92672;">=</span>
  exportToElm <span style="color: #E6DB74;">"/some/where/elm/src"</span> <span style="color: #F92672;">$</span>
  specsToDir
    <span style="color: #66d9ef;">[</span><span style="color: #66D9EF;">Spec</span> <span style="color: #a6e22e;">[</span><span style="color: #E6DB74;">"Generated"</span>,<span style="color: #E6DB74;">"Types"</span><span style="color: #a6e22e;">]</span>
          <span style="color: #a6e22e;">[</span>toElmTypeSource <span style="color: #e6db74;">(</span><span style="color: #66D9EF;">Proxy</span> <span style="color: #F92672;">::</span> <span style="color: #66D9EF;">Proxy</span> <span style="color: #66D9EF;">EnergyDisplayCertificate</span><span style="color: #e6db74;">)</span><span style="color: #a6e22e;">]</span><span style="color: #66d9ef;">]</span>
</pre>
</div>

</section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Output</h3>
<div class="org-src-container">

<pre  class="src src-elm"><span style="color: #66D9EF;">type alias </span><span style="color: #66D9EF;">EnergyDisplayCertificate</span> <span style="color: #A6E22E;">=</span>
    <span style="color: #66d9ef;">{</span> buildingNumber <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">String</span>
    <span style="color: #66D9EF;">,</span> postcode <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">String</span>
    <span style="color: #66D9EF;">,</span> energyRatingDescription <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">String</span>
    <span style="color: #66D9EF;">,</span> renewablesThermal <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">String</span>
    <span style="color: #66D9EF;">,</span> renewablesElectrical <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">String</span>
    <span style="color: #66D9EF;">,</span> floorArea <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Double</span>
    <span style="color: #66D9EF;">,</span> lodgementDate <span style="color: #A6E22E;">:</span> <span style="color: #66D9EF;">Date</span>
    <span style="color: #66d9ef;">}</span>
</pre>
</div>
</section>
<section id="slide-orgheadline27">
<h4 id="orgheadline27">Available</h4>
<ul>
<li><code>elm-export</code> on Hackage</li>
<li>github.com/krisajenkins/elm-export</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgheadline35">
<h2 id="orgheadline35">The Net Result</h2>
<div class="outline-text-2" id="text-orgheadline35">
</div></section>
<section id="slide-orgheadline30">
<h3 id="orgheadline30">Haskell</h3>
<p>
Many errors caught at compile time.
</p>
</section>
<section id="slide-orgheadline31">
<h3 id="orgheadline31">Elm</h3>
<p>
Many errors caught at compile time.
</p>
</section>
<section id="slide-orgheadline32">
<h3 id="orgheadline32">PostgreSQL</h3>
<p>
Many relationships enforced at compile time.
</p>
</section>
<section id="slide-orgheadline33">
<h3 id="orgheadline33">Haskell + Elm + PostgreSQL</h3>
<p>
Even more errors caught at compile time!
</p>
</section>
<section id="slide-orgheadline34">
<h3 id="orgheadline34">H.E.L.P. Is At Hand</h3>
<ul>
<li><b>H</b> askell</li>
<li><b>E</b> lm</li>
<li><b>L</b> inux</li>
<li><b>P</b> ostgreSQL</li>

</ul>

<p class="fragment (appear)">
<i>Though the general idea could work for lots of stacks&#x2026;</i>
</p>
</section>
</section>
</div>
</div>
<script src="reveal.js/lib/js/head.min.js"></script>
<script src="reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
minScale: 1.20,
maxScale: 3.00,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'convex', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
